快速启动指南
================================================================================
```
以下讲述的内容均假设用户已经安装了Java运行时环境，推荐使用Oracle公司提供的版本。
```
想知道如何运行HBase吗？想即刻知道HBase是如何工作的吗？用户只需要从Apache HBase发布版本页面下
载最新的HBase版本，并将内容解压到合适的目录，如`/usr/local`或者`/opt`即可，就像这样：
```shell
cd /opt
tar -xzvf hbase-2.1.3-bin.tar.gz
```
```
设置数据路径

此刻，就可以准备启动HBase了。在启动HBase之前，建议先把数据目录设置到合适的位置。需要编辑配置文件 conf/hbase-site.xml，
并设置合适的数据路径：通过对属性键hbase.rootdir赋值，来配置用户想要的HBase进行写操作的路径。

<?xml version="1.0"?>
<?xml-stylesheet type="text/xsl" href="configuration.xsl"?>
<configuration>
  <property>
    <name>hbase.rootdir</name>
    <value>file:///<PATH>/hbase</value>
  </property>
</configuration>

用户可以自定义上述示例配置文件中的<PATH>，将其替换为希望存储HBase数据的路径。默认情况下，hbase.rootdir设置为
/tmp/hbase-${user.name}，当服务器重启的时候，数据可能会丢失，因为很多操作系统会在重启的时候清空/tmp目录。
```
**替换之后，就可以启动HBase并开始第一次交互了**。在交互窗口中的提示符后面 **输入status命令**（
按回车键完成命令操作）：
```shell
cd /opt/hbase-2.1.3/bin/
./start-hbase.sh
```
```
running master, logging to /opt/hbase-2.1.3/bin/../logs/hbase-fuhd-master-ubuntu.out
```
```shell
./hbase shell
```
```
2019-03-04 19:50:48,400 WARN  [main] util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
HBase Shell
Use "help" to get list of supported commands.
Use "exit" to quit this interactive shell.
For Reference, please visit: http://hbase.apache.org/2.0/book.html#shell
Version 2.1.3, rda5ec9e4c06c537213883cca8f3cc9a7c19daf67, Mon Feb 11 15:45:33 CST 2019
Took 0.0024 seconds

hbase(main):001:0>
```
```shell
hbase(main):001:0> status
```
```
1 active master, 0 backup masters, 1 servers, 1 dead, 1.0000 average load
Took 0.4841 seconds                                                        
```
以上显示信息表明HBase已启动并且正在运行。下面通过使用一些命令证明HBase能够将数据存放进去，接着
对其进行检索。
```
现在我们运行的是所谓的单机模式（Standalone Mode），后面的章节将会看到多种可用的模式。现在了解下面这点很重要：在单机模式中
，一切事物都运行在单个Java进程中，并且所有的文件默认情况下都将存储在/tmp路径下————除非用户按照前文中给出的提示，改变了存
储路径。如果数据存储在默认路径下，服务器一旦重启，测试数据就会丢失。数据一旦被操作系统删除，将无法恢复。
```
现在来 **创建一个简单的表并新增几行数据**：
```shell
hbase(main):002:0> create 'testtable','colfam1'
```
```
0 row(s) in 1.5590 seconds
```
```shell
hbase(main):002:0> list 'testtable'
```
```
TABLE
testtable
1 row(s) in 0.0090 seconds
```
```shell
hbase(main):001:0> put 'testtable','myrow-1','colfam1:q1','value-1'
```
```
0 row(s) in 0.2730 seconds
```
```shell
hbase(main):001:0> put 'testtable','myrow-2','colfam1:q2','value-2'
```
```
0 row(s) in 0.2650 seconds
```
```shell
hbase(main):001:0> put 'testtable','myrow-2','colfam1:q3','value-3'
```
```
0 row(s) in 0.2590 seconds
```
































ddd
